blogs/mysql-acid-lock.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-01-09 一 19:03 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>MySQL InnoDB Locking and Transaction</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="root" />
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">MySQL InnoDB Locking and Transaction</h1>
<p>
事情起源于同事的一个问题，读表-修改-写表，在事务内完成，是否有并发问题？我想当然的以为没问题，不然要事务干什么？缺乏对事务的深入思考。事实是，这样有并发问题，如果不使用锁，是没法保证并发安全的。那么锁和事务是什么关系呢？
</p>

<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5"><span class="section-number-2">1</span> 事务</h2>
<div class="outline-text-2" id="text-1">
<p>
一般而言，如果数据库支持ACID属性，那么它就支持事务。事务只是数据库的一个特性而已，不是说有了事务，一些问题被神奇的解决了。还需要思考问题的内在逻辑。
</p>
</div>

<div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> A（atomicity）</h3>
<div class="outline-text-3" id="text-1-1">
<p>
原子性，事务内的所有操作，要么都做（ <code>COMMIT</code> ），要么都不做（ <code>ROLLBACK</code> ）。但做的对不对，不管。
例如订单系统，减库存和生成订单，要么库存减少，订单生成。要么库存没变化，订单没生成。但是，两个人同时买库存为一的商品，可能把库存减成负的，这是逻辑的问题，不是事务的问题。
</p>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">1.2</span> C（consistency）</h3>
<div class="outline-text-3" id="text-1-2">
<p>
一致性，事务结束时，数据库的主键约束，外键约束等其它特性，必须满足。（理解不深，觉得理所当然就该这样）
</p>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">1.3</span> I（isolation）</h3>
<div class="outline-text-3" id="text-1-3">
<p>
隔离性，同时运行的事务，应该相互隔离。并发控制和隔离性有关。
</p>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">1.4</span> D（durability）</h3>
<div class="outline-text-3" id="text-1-4">
<p>
持久性，完成的事务数据必须持久存储。
</p>

<p>
就ACID四个属性而言，AC的可选择性较小，ID的自由度比较大。例如D，数据落盘是个很复杂的过程，真要每次事务提交都实打实的写硬盘，性能是无法接受的。通常借助日志，RAID卡缓存提高性能。并且有时候降低D来提升性能。I有4个级别，不同级别对性能和业务的影响是不一样的。
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline10" class="outline-2">
<h2 id="orgheadline10"><span class="section-number-2">2</span> 锁</h2>
<div class="outline-text-2" id="text-2">
<p>
MySQL的读分 <code>锁读</code> 和 <code>一般读</code> ，不特殊强调的话，都是指一般读，一般读不加锁。锁分读锁 <code>S</code> 和写锁 <code>X</code> 。另外，同样的SQL，在不同的隔离级别下，加的锁也不同。下面的论述相当不专业，只是为了辅助理解事务隔离级别。
</p>
</div>

<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6"><span class="section-number-3">2.1</span> Intention Locks</h3>
<div class="outline-text-3" id="text-2-1">
<p>
主要指通过 <code>SELECT ... LOCK IN SHARE MODE</code> 和 <code>SELECT ... FOR UPDATE</code> 加的锁。前者加 <code>IS</code> 锁，后者加 <code>IX</code> 锁，他们和 <code>S</code> 和 <code>X</code> 略有不同。
</p>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7"><span class="section-number-3">2.2</span> Record Locks</h3>
<div class="outline-text-3" id="text-2-2">
<p>
记录锁，可以理解为每个锁对应一个记录
</p>
</div>
</div>

<div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8"><span class="section-number-3">2.3</span> Gap Locks</h3>
<div class="outline-text-3" id="text-2-3">
<p>
范围锁，锁一个范围，适用于返回多条记录的查询。
</p>
</div>
</div>

<div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9"><span class="section-number-3">2.4</span> Next-Key Locks</h3>
<div class="outline-text-3" id="text-2-4">
<p>
配合Gap Locks使用，适用于没有边界的情况。例如 <code>WHERE id &gt; 10</code> 。
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline15" class="outline-2">
<h2 id="orgheadline15"><span class="section-number-2">3</span> 事务的隔离级别</h2>
<div class="outline-text-2" id="text-3">
<p>
下面的陈述按照常用级别排序，从实例中可以看出，各个隔离级别锁数据的量是不一样的，这导致了性能的差异。同时，在并发时，理解SQL背后的锁，有助于理解业务逻辑是不是并发安全的。
</p>
</div>

<div id="outline-container-orgheadline11" class="outline-3">
<h3 id="orgheadline11"><span class="section-number-3">3.1</span> 可重复读（REPEATABLE READ）</h3>
<div class="outline-text-3" id="text-3-1">
<p>
所谓可重复读，就是在事务内部，所有查询都和第一次查询的结果相同（能看到首次查询前其它事务的提交，看不到之后其它事务的提交），但是可以看到本事务内的修改（虽然看不到其它事务的提交，但是如果修改，则可以看到）。写操作加写锁， <code>锁读</code> 加锁。这是MySQL的默认级别。
例如：
</p>
<div class="org-src-container">

<pre class="src src-ditta">  Session A                                   |     Session B
SELECT * FROM testt;                          |
+----+------+                                 |
| id | n    |                                 |
+----+------+                                 |
|  7 |  777 |                                 |
|  9 |  900 |                                 |
+----+------+                                 |
                                              |    START TRANSACTION;
START TRANSACTION;                            |
DELETE FROM testt WHERE id = 9;               |
COMMIT;                                       |    -- 看到之前的事务
                                              |    SELECT * FROM testt;
                                              |    +----+------+
                                              |    | id | n    |
                                              |    +----+------+
                                              |    |  7 |  777 |
                                              |    +----+------+
START TRANSACTION;                            |
INSERT INTO testt(id, n) VALUES(8, 800);      |
COMMIT;                                       |    -- 查询结果和首次查询一样
                                              |    SELECT * FROM testt;
                                              |    +----+------+
                                              |    | id | n    |
                                              |    +----+------+
                                              |    |  7 |  777 |
                                              |    +----+------+
                                              |
                                              |    -- 虽然看不到id=8的记录，但是可以更新
                                              |    UPDATE testt SET n = 888 WHERE id = 8;
                                              |
                                              |    -- 更新之后可以看到id=8的记录
                                              |    SELECT * FROM testt;
                                              |    +----+------+
                                              |    | id | n    |
                                              |    +----+------+
                                              |    |  7 |  777 |
                                              |    |  8 |  888 |
-- 看不到未提交的修改                         |    +----+------+
SELECT * FROM testt;                          |
+----+------+                                 |
| id | n    |                                 |
+----+------+                                 |
|  7 |  777 |                                 |
|  8 |  800 |                                 |
+----+------+                                 |    -- 更新加写锁 Record Locks
                                              |    UPDATE testt SET n = 7 WHERE id = 7;
START TRANSACTION;                            |
-- 无法加写锁，超时                           |
UPDATE testt SET n = 77 WHERE id = 7;         |
ERROR 1205 (HY000): Lock wait timeout...      |    -- 加Gap Locks和 Next-Key Locks
                                              |    SELECT * FROM testt SET n &gt;= 8 FOR UPDATE;
-- 因为Next-Key Locks，插入失败               |
INSERT INTO testt(id, n) VALUES(9, 999);      |
ERROR 1205 (HY000): Lock wait timeout...      |
                                              |    ROLLBACK; START TRANSACTION;
                                              |    -- 所有的行都加上了锁，虽然只有id = 8符合条件
                                              |    UPDATE testt SET n = 0 WHERE n &gt;= 800;
UPDATE testt SET n = 77 WHERE id = 7;         |
ERROR 1205 (HY000): Lock wait timeout...      |
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline12" class="outline-3">
<h3 id="orgheadline12"><span class="section-number-3">3.2</span> 读已提交（READ COMMITTED）</h3>
<div class="outline-text-3" id="text-3-2">
<p>
事务内部可以读到其它事务提交的结果。这个导致 <b>幻读</b> （我理解幻读就是读到的数据不确定的意思），取决于业务逻辑，幻读不一定是个问题。它的另一个问题是 <code>锁读</code> 没有 Next-Key Locks。测试前需要设置隔离级别， <code>SET TRANSACTION ISOLATION LEVEL READ COMMITTED;</code> 。
例如：
</p>
<div class="org-src-container">

<pre class="src src-ditta">  Session A                                   |      Session B
                                              |    START TRANSACTION;
                                              |    SELECT * FROM testt;
                                              |    +----+------+
                                              |    | id | n    |
                                              |    +----+------+
                                              |    |  7 |  777 |
                                              |    |  8 |  888 |
                                              |    +----+------+
START TRANSACTION;                            |
UPDATE testt SET n = 700 WHERE id = 7;        |
COMMIT;                                       |    -- 看到其它事务的提交，不同于首次查询
                                              |    SELECT * FROM testt;
                                              |    +----+------+
                                              |    | id | n    |
                                              |    +----+------+
                                              |    |  7 |  700 |
                                              |    |  8 |  888 |
                                              |    +----+------+
                                              |
                                              |    -- 加Gap Locks
                                              |    SELECT * FROM testt WHERE id &gt;= 7 LOCK IN SHARE MODE;
START TRANSACTION;                            |
-- 有IS锁，更新失败                           |
UPDATE testt SET n = 800 WHERE id = 8;        |
ERROR 1205 (HY000): Lock wait timeout...      |
                                              |
-- 没有Next-Key Locks，插入成功               |
INSERT INTO testt(id, n) VALUES(9, 900);      |
                                              |    ROLLBACK; START TRANSACTION;
                                              |    -- 只有符合条件的id = 8才加锁
                                              |    UPDATE testt SET n = 0 WHERE n &gt;= 800;
UPDATE testt SET n = 77 WHERE id = 7;         |
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline13" class="outline-3">
<h3 id="orgheadline13"><span class="section-number-3">3.3</span> 读未提交（READ UNCOMMITTED）</h3>
<div class="outline-text-3" id="text-3-3">
<p>
可以读到未提交的数据。导致 <b>脏读</b> ，因为数据最终可能未提交。
</p>
</div>
</div>

<div id="outline-container-orgheadline14" class="outline-3">
<h3 id="orgheadline14"><span class="section-number-3">3.4</span> 串行化（SERIALIZABLE）</h3>
<div class="outline-text-3" id="text-3-4">
<p>
和重复读类似，除了所有的读都是 <code>LOCK IN SHARE MODE</code> ，写性能大大降低。
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline16" class="outline-2">
<h2 id="orgheadline16"><span class="section-number-2">4</span> 读-修改-写</h2>
<div class="outline-text-2" id="text-4">
<p>
回到最初的问题，默认隔离级别。读-修改-写，不是并发安全的，多个线程可以并发的读到相同的数据，然后各自修改，这不是业务需要的。可以使用 <code>SELECT ... FOR UPDATE</code> 防止并发读写。虽然可以使用 <code>锁读</code> 来控制锁，但是死锁的概率也大大提升。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: root</p>
<p class="date">Created: 2017-01-09 一 19:03</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
